; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v5 - type_2 ?v2 - type_1)
 	      (pred_1 ?v4 - object ?v2 - type_1)
	      (pred_4 ?v5 - type_2 ?v6 - type_3)
	      (pred_2 ?v5 - type_2 ?v4 - object ?v6 - type_3))

   (:action op_1
       :parameters  (?v5 - type_2 ?v7 ?v8 - type_1)
       :precondition (and  (pred_3 ?v5 ?v7))
       :effect (and  (pred_3 ?v5 ?v8)
		     (not (pred_3 ?v5 ?v7))))

   (:action op_3
       :parameters (?v5 - type_2 ?v1 - object ?v3 - type_1 ?v6 - type_3)
       :precondition  (and  (pred_1 ?v1 ?v3) (pred_3 ?v5 ?v3) (pred_4 ?v5 ?v6))
       :effect (and (pred_2 ?v5 ?v1 ?v6)
		    (not (pred_1 ?v1 ?v3)) 
		    (not (pred_4 ?v5 ?v6))))

   (:action op_2
       :parameters (?v5 - type_2 ?v1 - object ?v3 - type_1 ?v6 - type_3)
       :precondition  (and  (pred_2 ?v5 ?v1 ?v6) (pred_3 ?v5 ?v3))
       :effect (and (pred_1 ?v1 ?v3)
		    (pred_4 ?v5 ?v6)
		    (not (pred_2 ?v5 ?v1 ?v6)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_04 obj_11 - type_2
obj_06 obj_13 obj_12 obj_07 - type_3
obj_08 obj_09 obj_02 obj_05 - type_1
obj_10 obj_03 obj_01 - object)
(:init
(pred_3 obj_04 obj_02)
(pred_4 obj_04 obj_06)
(pred_4 obj_04 obj_13)
(pred_3 obj_11 obj_02)
(pred_4 obj_11 obj_12)
(pred_4 obj_11 obj_07)
(pred_1 obj_10 obj_08)
(pred_1 obj_03 obj_08)
(pred_1 obj_01 obj_08)
)
(:goal
(and
(pred_1 obj_10 obj_05)
(pred_1 obj_03 obj_08)
(pred_1 obj_01 obj_08)
)
)

(:constraints
  (always (not (pred_3 obj_04 obj_05)))
)
)

; plan
1. (op_1 obj_04 obj_02 obj_08)
   deleted: (pred_3 obj_04 obj_02)
   added: (pred_3 obj_04 obj_08)
   goals met: 2 of 3
2. (op_1 obj_11 obj_02 obj_08)
   deleted: (pred_3 obj_11 obj_02)
   added: (pred_3 obj_11 obj_08)
   goals met: 2 of 3
3. (op_3 obj_11 obj_10 obj_08 obj_07)
   deleted: (pred_1 obj_10 obj_08) (pred_4 obj_11 obj_07)
   added: (pred_2 obj_11 obj_10 obj_07)
   goals met: 2 of 3
4. (op_1 obj_11 obj_08 obj_05)
   deleted: (pred_3 obj_11 obj_08)
   added: (pred_3 obj_11 obj_05)
   goals met: 2 of 3
5. (op_2 obj_11 obj_10 obj_05 obj_07)
   deleted: (pred_2 obj_11 obj_10 obj_07)
   added: (pred_1 obj_10 obj_05) (pred_4 obj_11 obj_07)
   goals met: 3 of 3
